<?php
if (!defined('ABSPATH')) {
    exit;
}

function bale_cmd_faq_bot($chat_id) {
    $buttons = [
        [bale_make_link_button('مشاهده سوالات متداول', '/my-account/sc-faq/')],
        [bale_make_link_button('ثبت تیکت پشتیبانی', '/my-account/sc-support-tickets')],
    ];

    $faq_list = "
*۱- آیا در سایت حتما باید اطلاعاتم را تکمیل کنم؟*
خیر، لزومی به ثبت تمامی اطلاعات نیست مگر به اجبار مدیریت مجموعه.

*۲- چرا در ثبت‌نام دوره هیچ دوره‌ای برای من نیست؟*
ممکن است دوره در انتظار پرداخت باشد. فیلتر ثبت‌نام را روی «همه دوره‌ها» قرار دهید.

*۳- صورتحساب را نمی‌توانم لغو کنم؛ چرا؟*
در حال حاضر فقط مدیریت می‌تواند صورتحساب را لغو کند.
";

    $text = "*بخش سوالات متداول*\n\n"
        . "در صورتی که سوال خود را پیدا نکردید از بخش تیکت پشتیبانی پیام ارسال کنید.\n\n"
        . $faq_list;

    bale_send_message_with_buttons($chat_id, $text, $buttons);
}
